// ### 1. UserInput 클래스

// - **자동차 이름 설정**
//   - 사용자가 쉼표(,)로 구분하여 입력한 자동차 이름을 설정한다.
//   - 각 이름은 5자 이하로 제한되며, 이를 위반할 경우 "[ERROR] 자동차 이름은 5자 이하로 입력해야 합니다."를 출력한다.
  
// - **시도 횟수 설정**
//   - 사용자가 경주 시도 횟수를 입력할 수 있으며, 이때 값이 0이거나 음수일 경우 에러를 발생시키고 "[ERROR] 경주 시도 횟수는 양수여야 합니다."를 출력한다.


class UserInput {
    // 자동차 이름 배열과 시도 횟수를 저장
    constructor() {}

    // 자동차 이름을 사용자에게 입력받아 설정
    inputCarNames() {}

    // 경주 시도 횟수를 사용자에게 입력받아 설정
    inputAttempts() {}

    // 입력 값이 유효한지 확인
    validateInput() {}
}